kmdf.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Basc Knowledge of Kernel-Mode Driver Framework(KMDF)</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Basc Knowledge of Kernel-Mode Driver Framework(KMDF)"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-12-09 日"/>
<meta name="author" content="Yannik.Li"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="./style.css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Basc Knowledge of Kernel-Mode Driver Framework(KMDF)</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 About KMDF</a></li>
<li><a href="#sec-2">2 mini-port driver, port driver and class driver</a></li>
<li><a href="#sec-3">3 How to register a class filter driver manually</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> About KMDF</h2>
<div class="outline-text-2" id="text-1">

<p>Kernel-Mode Driver Framework(KMDF) is a library that you can use to develop kernel-mode drivers that support the WDM. KMDF provides common driver functionality, which enables you to write a driver with significantly less code than in WDM. KMDF support Object module, the basic object of KMDF include WDFDEVICE, WDFDRIVER, WDFREQUEST, WDFQUEUE and so on. the device stack same to WDM, the device object devide into PDO, FDO and FiDO.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> mini-port driver, port driver and class driver</h2>
<div class="outline-text-2" id="text-2">

<p>For every class of device, provide a class driver to support the class of device, the class driver provide a common functional collection independly from specific device class. class driver always provided by Microsoft, and the part is device independly.
the lowest layer driver is called miniport driver, it is complete the parts directly relate to hardware device, and port driver provide service for miniport driver, it include some common function used for miniport driver.
so, the type of driver from high layer to low is: class driver, port driver, miniport driver. The class driver provide interface for user, the miniport driver directly communicat with hardware.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> How to register a class filter driver manually</h2>
<div class="outline-text-2" id="text-3">

<p>Just use kbdclass filter driver as example, the class filter driver called kbfiltr.
</p><ul>
<li>Went into the registry and modified the HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\Class\{4D36E96B-E325-11CE-BFC1-08002BE10318}\UpperFilters key, and set the UpperFilters to "kbfiltr kdbclass".

</li>
<li>Created a new reg key at HKLM/SYSTEM/CurrentControlSet/Services and called it kbfiltr. created the values as below:<br/>
        Type (dword) : 00000001<br/>
        Start (dword) : 00000003<br/>
        ErrorControl (dword) : 00000000<br/>
        Tag (dword) : 00000006<br/>
        ImagePath (reg_expand_sz) : system32\DRIVERS\kbfiltr.sys<br/>
        DisplayName (reg_sz) : Keyboard Filter Example<br/>
        Group (reg_sz) : Keyboard Port<br/>
</li>
</ul>


</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-12-09 日</p>
<p class="author">Author: Yannik.Li</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
